#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Есть значение радиуса круга
RADIUS = 42

# Выведите на консоль значение площади этого круга с точностью до 4х знаков после запятой
# подсказки:
#       формулу можно подсмотреть в интернете,
#       пи возьмите равным 3.1415926
#       точность указывается в функции round()
PI = 3.1415926


def circle_area(radius, pi=PI):
    return round(pi * radius ** 2, 4)


# Далее, пусть есть координаты точки
POINT_A = (23, 34)
# где 23 - координата х, 34 - координата у

# Если точка point лежит внутри того самого круга [центр в начале координат (0, 0), radius = 42],
# то выведите на консоль True, Или False, если точка лежит вовне круга.
# подсказки:
#       нужно определить расстояние от этой точки до начала координат (0, 0)
#       формула так же есть в интернете
#       квадратный корень - это возведение в степень 0.5
#       операции сравнения дают булевы константы True и False


def is_inside_circle(point, radius):
    """Точка строго внутри круга расстояние до центра меньше радиуса"""
    x, y = point
    return (x ** 2 + y ** 2) ** 0.5 < radius


# Аналогично для другой точки
POINT_B = (30, 30)
# Если точка point_2 лежит внутри круга (radius = 42), то выведите на консоль True,
# Или False, если точка лежит вовне круга.


def run():
    print(circle_area(RADIUS))
    print(is_inside_circle(POINT_A, RADIUS))
    print(is_inside_circle(POINT_B, RADIUS))


if __name__ == '__main__':
    run()

# Пример вывода на консоль:
#
# 77777.7777
# False
# False
